# Даны две числовые переменные, напишите программу, которая меняет значения переменных местами.

a = 5
b = 10
# До
print(a, b)

a, b = b, a
# После
print(a, b)

