'''
Напишите программу, на вход подается значения сторон квадрата, необходимо найти площадь и периметр квадрата. Полученный результат вывести на экран.
'''

a = int(input('Введите значение стороны: '))

print(f'Площадь квадрата равна: {a*a}')
print(f'Периметр квадрата равна: {4*a}')