# Напишите программу: найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
print(sum((range(1, 101))))