# Напишите программу: вводятся три целых числа. Определить какое из них наибольшее

a = int(input())
b = int(input())
c = int(input())

print('Наимбольшее число: ' + str(max(a, b, c)))
